<?xml version="1.0" ?>
<net name="dualpath_singlelead_2s" version="10">
	<layers>
		<layer id="0" name="inputs" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 1008, 1"/>
			<output>
				<port id="0" names="inputs:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1d/conv1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="conv1d/conv1d/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv1d/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv1d/conv1d/ExpandDims/Transpose/value3403675202" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1d/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1d/conv1d/ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1d/conv1d/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f16" offset="40" shape="9, 1, 1, 3" size="54"/>
			<output>
				<port id="0" names="conv1d/conv1d/ExpandDims_1:0" precision="FP16">
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1d/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>9</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_4441" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Squeeze_4442" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1d/conv1d/Squeeze:0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_4443" type="Const" version="opset1">
			<data element_type="i64" offset="102" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv1d/conv1d/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="data_mul_2527025274" type="Const" version="opset1">
			<data element_type="f16" offset="126" shape="1, 1, 9" size="18"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="batch_normalization/batchnorm/mul_1/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_2527125276" type="Const" version="opset1">
			<data element_type="f16" offset="144" shape="1, 1, 9" size="18"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv1d/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization/batchnorm/add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv1d_1/conv1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="conv1d_1/conv1d/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv1d_1/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv1d_1/conv1d/ExpandDims/Transpose/value3404076027" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv1d_1/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1d_1/conv1d/ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv1d_1/conv1d/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f16" offset="162" shape="9, 9, 1, 3" size="486"/>
			<output>
				<port id="0" names="conv1d_1/conv1d/ExpandDims_1:0" precision="FP16">
					<dim>9</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv1d_1/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>9</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_4448" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Squeeze_4449" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1d_1/conv1d/Squeeze:0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_4450" type="Const" version="opset1">
			<data element_type="i64" offset="102" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv1d_1/conv1d/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_mul_2527825282" type="Const" version="opset1">
			<data element_type="f16" offset="648" shape="1, 1, 9" size="18"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="batch_normalization_1/batchnorm/mul_1/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_2527925284" type="Const" version="opset1">
			<data element_type="f16" offset="666" shape="1, 1, 9" size="18"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv1d_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_1/batchnorm/add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_1/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv1d_2/conv1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="conv1d_2/conv1d/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv1d_2/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv1d_2/conv1d/ExpandDims/Transpose/value3404476612" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv1d_2/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1d_2/conv1d/ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv1d_2/conv1d/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f16" offset="684" shape="9, 9, 1, 3" size="486"/>
			<output>
				<port id="0" names="conv1d_2/conv1d/ExpandDims_1:0" precision="FP16">
					<dim>9</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv1d_2/conv1d" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>9</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_4455" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Squeeze_4456" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1d_2/conv1d/Squeeze:0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_4457" type="Const" version="opset1">
			<data element_type="i64" offset="102" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv1d_2/conv1d/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_mul_2528625290" type="Const" version="opset1">
			<data element_type="f16" offset="1170" shape="1, 1, 9" size="18"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="batch_normalization_2/batchnorm/mul_1/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_2528725292" type="Const" version="opset1">
			<data element_type="f16" offset="1188" shape="1, 1, 9" size="18"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv1d_2/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_2/batchnorm/add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="activation_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_2/Relu:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="add/add:0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="embedding/conv1d/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="embedding/conv1d/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="embedding/conv1d/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="embedding/conv1d/ExpandDims/Transpose/value3404876165" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="embedding/conv1d/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1008</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="embedding/conv1d/ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="embedding/conv1d/ExpandDims_1" type="Const" version="opset1">
			<data element_type="f16" offset="1206" shape="128, 9, 1, 16" size="36864"/>
			<output>
				<port id="0" names="embedding/conv1d/ExpandDims_1:0" precision="FP16">
					<dim>128</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="embedding/conv1d" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 16"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>1008</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>9</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_4462" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Squeeze_4463" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>63</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="embedding/conv1d/Squeeze:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_4464" type="Const" version="opset1">
			<data element_type="i64" offset="102" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="embedding/conv1d/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>63</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="embedding/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="38070" shape="1, 1, 128" size="256"/>
			<output>
				<port id="0" names="embedding/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="embedding/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="embedding/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Transformer/posembed_input/add/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="38326" shape="1, 63, 128" size="16128"/>
			<output>
				<port id="0" names="Transformer/posembed_input/add/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Transformer/posembed_input/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/posembed_input/add:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Transformer/encoderblock_0/layer_normalization/moments/mean/reduction_indices" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="1" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/layer_normalization/moments/mean/reduction_indices:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Transformer/encoderblock_0/layer_normalization/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/layer_normalization/moments/StopGradient:0,Transformer/encoderblock_0/layer_normalization/moments/mean:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transformer/encoderblock_0/layer_normalization/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/layer_normalization/moments/SquaredDifference:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Transformer/encoderblock_0/layer_normalization/moments/variance/reduction_indices" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="1" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/layer_normalization/moments/variance/reduction_indices:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Transformer/encoderblock_0/layer_normalization/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/layer_normalization/moments/variance:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Transformer/encoderblock_0/layer_normalization/batchnorm/add/y" type="Const" version="opset1">
			<data element_type="f16" offset="54454" shape="1, 1, 1" size="2"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/layer_normalization/batchnorm/add/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Transformer/encoderblock_0/layer_normalization/batchnorm/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="2162" type="Const" version="opset1">
			<data element_type="f16" offset="54456" shape="1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Transformer/encoderblock_0/layer_normalization/batchnorm/Rsqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/layer_normalization/batchnorm/Rsqrt:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Transformer/encoderblock_0/layer_normalization/batchnorm/mul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="54458" shape="1, 1, 128" size="256"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/layer_normalization/batchnorm/mul/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Transformer/encoderblock_0/layer_normalization/batchnorm/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/layer_normalization/batchnorm/mul:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Transformer/encoderblock_0/layer_normalization/batchnorm/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/layer_normalization/batchnorm/mul_1:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Transformer/encoderblock_0/layer_normalization/batchnorm/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="54714" shape="1, 1, 128" size="256"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/layer_normalization/batchnorm/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Transformer/encoderblock_0/layer_normalization/batchnorm/mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Transformer/encoderblock_0/layer_normalization/batchnorm/sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/layer_normalization/batchnorm/sub:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Transformer/encoderblock_0/layer_normalization/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/key/Tensordot/transpose:0,Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/transpose:0,Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/values/Tensordot/transpose:0,Transformer/encoderblock_0/layer_normalization/batchnorm/add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Shape:0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/free" type="Const" version="opset1">
			<data element_type="i32" offset="54970" shape="2" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/free:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="80" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Const" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="1" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Const:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Prod" type="ReduceProd" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Prod:0" precision="I32"/>
			</output>
		</layer>
		<layer id="83" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/stack/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/stack/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/axes" type="Const" version="opset1">
			<data element_type="i32" offset="54986" shape="1" size="4"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/axes:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2_1/axis" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2_1/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="87" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2_1" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/GatherV2_1:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Const_1" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="1" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Const_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Prod_1" type="ReduceProd" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Prod_1:0" precision="I32"/>
			</output>
		</layer>
		<layer id="90" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/stack/Unsqueeze2301_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/stack/Unsqueeze2301" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/stack" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Reshape/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/stack:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Reshape:0" precision="FP16">
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Reshape_1" type="Const" version="opset1">
			<data element_type="f16" offset="54990" shape="128, 128" size="32768"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Reshape_1:0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/MatMul:0" precision="FP16">
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Const_2" type="Const" version="opset1">
			<data element_type="i32" offset="87758" shape="1" size="4"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Const_2:0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/concat_1" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot/concat_1:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/Tensordot:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="87762" shape="1, 1, 128" size="256"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/query/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>63</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Shape:0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="1" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="108" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Reshape/shape/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="54978" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Reshape/shape/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Reshape/shape/Unsqueeze2233" type="Const" version="opset1">
			<data element_type="i32" offset="88018" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Reshape/shape/Unsqueeze2235" type="Const" version="opset1">
			<data element_type="i32" offset="88022" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Reshape/shape/Unsqueeze2237" type="Const" version="opset1">
			<data element_type="i32" offset="88026" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Reshape/shape" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Transformer/encoderblock_0/Transformer/encoderblock_0/MultiHeadDotProductAttention_1/Reshape/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
