<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="inputs" type="Parameter" version="opset1">
			<data shape="1,129,18,12,2" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inputs,inputs:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Transpose_31076" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="0" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_31068" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="64" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Transpose_31046" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="128" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Transpose_31038" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="208" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_31016" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="288" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_31008" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="432" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_30986" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="576" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_30978" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="640" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Transpose_30956" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="704" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Transpose_30948" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="784" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Transpose_30926" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="864" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Transpose_30918" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="1008" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Transpose_30896" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1152" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Transpose_30888" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1216" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Transpose_30866" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1280" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Transpose_30858" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1360" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Transpose_30836" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="1440" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Transpose_30828" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="1584" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Transpose_30806" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1728" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Transpose_30798" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1792" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Transpose_30776" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1856" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_30768" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1936" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Transpose_30746" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2016" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Transpose_30738" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2160" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Transpose_30716" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="2304" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Transpose_30708" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="2368" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Transpose_30686" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="2432" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Transpose_30678" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="2512" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Transpose_30656" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2592" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Transpose_30648" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2736" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_488" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Transpose_489" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Transpose_491" type="Const" version="opset1">
			<data element_type="f32" shape="36, 2, 9, 3, 1" offset="2920" size="7776" />
			<output>
				<port id="0" precision="FP32">
					<dim>36</dim>
					<dim>2</dim>
					<dim>9</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Convolution_492" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>36</dim>
					<dim>2</dim>
					<dim>9</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_42361" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="10696" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Transpose_30646" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Transpose_30650" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Transpose_40469" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="10840" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_30645" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10984" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="complex_batch_normalization_1/sub_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/sub_2,complex_batch_normalization_1/sub_2:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="complex_batch_normalization_1/strided_slice_13/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11024" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_13/stack,complex_batch_normalization_1/strided_slice_13/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="complex_batch_normalization_1/strided_slice_13/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_13/stack_1,complex_batch_normalization_1/strided_slice_13/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="complex_batch_normalization_1/strided_slice_13/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_13/stack_2,complex_batch_normalization_1/strided_slice_13/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="complex_batch_normalization_1/strided_slice_13" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 0" end_mask="1, 1, 1, 1, 1" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="complex_batch_normalization_1/strided_slice_13,complex_batch_normalization_1/strided_slice_13:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_40472" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_40473" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="complex_batch_normalization_1/strided_slice_12/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_12/stack,complex_batch_normalization_1/strided_slice_12/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="complex_batch_normalization_1/strided_slice_12/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11024" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_12/stack_1,complex_batch_normalization_1/strided_slice_12/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="complex_batch_normalization_1/strided_slice_12/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_12/stack_2,complex_batch_normalization_1/strided_slice_12/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="complex_batch_normalization_1/strided_slice_12" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 1" end_mask="1, 1, 1, 1, 0" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="complex_batch_normalization_1/strided_slice_12,complex_batch_normalization_1/strided_slice_12:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_40474" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Transpose_40475" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Transpose_40471" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/concat_8,complex_batch_normalization_1/concat_8:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Transpose_30652" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/mul_24,complex_batch_normalization_1/mul_24:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Transpose_30654" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Transpose_30658" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_40477" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="11084" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_30653" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10984" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="complex_batch_normalization_1/add_13" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/add_13,complex_batch_normalization_1/add_13:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="complex_batch_normalization_1/strided_slice_15/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11024" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_15/stack,complex_batch_normalization_1/strided_slice_15/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="complex_batch_normalization_1/strided_slice_15/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_15/stack_1,complex_batch_normalization_1/strided_slice_15/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="complex_batch_normalization_1/strided_slice_15/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_15/stack_2,complex_batch_normalization_1/strided_slice_15/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="complex_batch_normalization_1/strided_slice_15" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 0" end_mask="1, 1, 1, 1, 1" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="complex_batch_normalization_1/strided_slice_15,complex_batch_normalization_1/strided_slice_15:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_40480" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Transpose_40481" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="complex_batch_normalization_1/strided_slice_14/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_14/stack,complex_batch_normalization_1/strided_slice_14/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="complex_batch_normalization_1/strided_slice_14/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11024" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_14/stack_1,complex_batch_normalization_1/strided_slice_14/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="complex_batch_normalization_1/strided_slice_14/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_1/strided_slice_14/stack_2,complex_batch_normalization_1/strided_slice_14/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="complex_batch_normalization_1/strided_slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 1" end_mask="1, 1, 1, 1, 0" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="complex_batch_normalization_1/strided_slice_14,complex_batch_normalization_1/strided_slice_14:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_40482" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Transpose_40483" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Transpose_40479" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/concat_11,complex_batch_normalization_1/concat_11:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Transpose_30660" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/mul_26,complex_batch_normalization_1/mul_26:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Transpose_30662" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Transpose_30664" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="11228" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Transpose_30666" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Relu_30667" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Transpose_1149" type="Const" version="opset1">
			<data element_type="f32" shape="20, 36, 5, 3, 1" offset="11372" size="43200" />
			<output>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>36</dim>
					<dim>5</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Convolution_1150" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>36</dim>
					<dim>5</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_42364" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="54572" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Transpose_30676" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Transpose_30680" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Transpose_40485" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="54652" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_30675" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10984" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="complex_batch_normalization_2/sub_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/sub_2,complex_batch_normalization_2/sub_2:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="complex_batch_normalization_2/strided_slice_13/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="54732" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_13/stack,complex_batch_normalization_2/strided_slice_13/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="complex_batch_normalization_2/strided_slice_13/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_13/stack_1,complex_batch_normalization_2/strided_slice_13/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="complex_batch_normalization_2/strided_slice_13/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_13/stack_2,complex_batch_normalization_2/strided_slice_13/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="complex_batch_normalization_2/strided_slice_13" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 0" end_mask="1, 1, 1, 1, 1" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="complex_batch_normalization_2/strided_slice_13,complex_batch_normalization_2/strided_slice_13:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_40488" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Transpose_40489" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="complex_batch_normalization_2/strided_slice_12/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_12/stack,complex_batch_normalization_2/strided_slice_12/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="complex_batch_normalization_2/strided_slice_12/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="54732" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_12/stack_1,complex_batch_normalization_2/strided_slice_12/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="complex_batch_normalization_2/strided_slice_12/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_12/stack_2,complex_batch_normalization_2/strided_slice_12/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="complex_batch_normalization_2/strided_slice_12" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 1" end_mask="1, 1, 1, 1, 0" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="complex_batch_normalization_2/strided_slice_12,complex_batch_normalization_2/strided_slice_12:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_40490" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Transpose_40491" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Transpose_40487" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/concat_8,complex_batch_normalization_2/concat_8:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Transpose_30682" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/mul_24,complex_batch_normalization_2/mul_24:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Transpose_30684" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Transpose_30688" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Transpose_40493" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="54752" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_30683" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10984" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="complex_batch_normalization_2/add_13" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/add_13,complex_batch_normalization_2/add_13:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="complex_batch_normalization_2/strided_slice_15/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="54732" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_15/stack,complex_batch_normalization_2/strided_slice_15/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="complex_batch_normalization_2/strided_slice_15/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_15/stack_1,complex_batch_normalization_2/strided_slice_15/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="complex_batch_normalization_2/strided_slice_15/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_15/stack_2,complex_batch_normalization_2/strided_slice_15/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="complex_batch_normalization_2/strided_slice_15" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 0" end_mask="1, 1, 1, 1, 1" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="complex_batch_normalization_2/strided_slice_15,complex_batch_normalization_2/strided_slice_15:0">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_40496" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Transpose_40497" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="complex_batch_normalization_2/strided_slice_14/stack" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11044" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_14/stack,complex_batch_normalization_2/strided_slice_14/stack:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="complex_batch_normalization_2/strided_slice_14/stack_1" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="54732" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_14/stack_1,complex_batch_normalization_2/strided_slice_14/stack_1:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="complex_batch_normalization_2/strided_slice_14/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="5" offset="11064" size="20" />
			<output>
				<port id="0" precision="I32" names="complex_batch_normalization_2/strided_slice_14/stack_2,complex_batch_normalization_2/strided_slice_14/stack_2:0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="complex_batch_normalization_2/strided_slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 1, 1" end_mask="1, 1, 1, 1, 0" new_axis_mask="0, 0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0, 0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>18</dim>
					<dim>12</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I32">
