<?xml version="1.0"?>
<net name="DenoiseModel_128hz_8lead_1s" version="11">
	<layers>
		<layer id="0" name="inputs" type="Parameter" version="opset1">
			<data shape="1,33,9,8,2" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 4, 1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="inputs,inputs:0">
					<dim>1</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="complex_batch_normalization_15/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="0" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_15/concat_9:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="complex_batch_normalization_15/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="64" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_15/concat_6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="complex_batch_normalization_14/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="128" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_14/concat_9:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="complex_batch_normalization_14/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="208" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_14/concat_6:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="complex_batch_normalization_13/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="288" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_13/concat_9:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="complex_batch_normalization_13/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="432" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_13/concat_6:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="complex_batch_normalization_12/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="576" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_12/concat_9:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="complex_batch_normalization_12/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="640" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_12/concat_6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="complex_batch_normalization_11/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="704" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_11/concat_9:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="complex_batch_normalization_11/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="784" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_11/concat_6:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="complex_batch_normalization_10/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="864" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_10/concat_9:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="complex_batch_normalization_10/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="1008" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_10/concat_6:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="complex_batch_normalization_9/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1152" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_9/concat_9:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="complex_batch_normalization_9/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1216" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_9/concat_6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="complex_batch_normalization_8/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1280" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_8/concat_9:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="complex_batch_normalization_8/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1360" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_8/concat_6:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="complex_batch_normalization_7/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="1440" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_7/concat_9:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="complex_batch_normalization_7/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="1584" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_7/concat_6:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="complex_batch_normalization_6/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1728" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_6/concat_9:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="complex_batch_normalization_6/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="1792" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_6/concat_6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="complex_batch_normalization_5/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1856" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_5/concat_9:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="complex_batch_normalization_5/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="1936" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_5/concat_6:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="complex_batch_normalization_4/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2016" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_4/concat_9:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="complex_batch_normalization_4/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2160" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_4/concat_6:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="complex_batch_normalization_3/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="2304" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_3/concat_9:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="complex_batch_normalization_3/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="2368" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_3/concat_6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="complex_batch_normalization_2/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="2432" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_2/concat_9:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="complex_batch_normalization_2/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="2512" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_2/concat_6:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="complex_batch_normalization_1/mul_25/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2592" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_1/concat_9:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="complex_batch_normalization_1/mul_23/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="2736" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_1/concat_6:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="inputs/Transpose([0 4 1 2 3])/value5333080633" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="2880" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="inputs/Transpose([0 4 1 2 3])" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="complex_conv3d_1/concat_2" type="Const" version="opset1">
			<data element_type="f32" shape="36, 2, 9, 3, 1" offset="2920" size="7776" />
			<output>
				<port id="0" precision="FP32" names="complex_conv3d_1/concat_2:0">
					<dim>36</dim>
					<dim>2</dim>
					<dim>9</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="complex_conv3d_1/convolution" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>36</dim>
					<dim>2</dim>
					<dim>9</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_conv3d_1/convolution:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_4065782307" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="10696" size="144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="complex_conv3d_1/add_1/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/sub_2:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="complex_batch_normalization_1/mul_23" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/mul_23:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="complex_batch_normalization_1/mul_24/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="10840" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_1/concat_7:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="5340581845" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10984" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="40" name="3169882112" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="10992" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="complex_batch_normalization_1/strided_slice_12/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="complex_batch_normalization_1/strided_slice_12:0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32" names="complex_batch_normalization_1/strided_slice_13:0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="complex_batch_normalization_1/concat_8" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/concat_8:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="complex_batch_normalization_1/mul_24" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/mul_24:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="complex_batch_normalization_1/add_13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/add_13:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="complex_batch_normalization_1/mul_25" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/mul_25:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="complex_batch_normalization_1/mul_26/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="11008" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_1/concat_10:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="5341180024" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10984" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="48" name="3170382187" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="10992" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="complex_batch_normalization_1/strided_slice_14/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="complex_batch_normalization_1/strided_slice_14:0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32" names="complex_batch_normalization_1/strided_slice_15:0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="complex_batch_normalization_1/concat_11" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/concat_11:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="complex_batch_normalization_1/mul_26" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/mul_26:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="complex_batch_normalization_1/add_14" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/add_14:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="complex_batch_normalization_1/add_15/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 36, 1, 1, 1" offset="11152" size="144" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_1/Reshape_15:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="complex_batch_normalization_1/add_15" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_1/add_15:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="activation_1/Relu:0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="complex_conv3d_2/concat_2" type="Const" version="opset1">
			<data element_type="f32" shape="20, 36, 5, 3, 1" offset="11296" size="43200" />
			<output>
				<port id="0" precision="FP32" names="complex_conv3d_2/concat_2:0">
					<dim>20</dim>
					<dim>36</dim>
					<dim>5</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="complex_conv3d_2/convolution" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>36</dim>
					<dim>5</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_conv3d_2/convolution:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_406594066181620" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="54496" size="80" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="complex_conv3d_2/add_1/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/sub_2:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="complex_batch_normalization_2/mul_23" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/mul_23:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="complex_batch_normalization_2/mul_24/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="54576" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_2/concat_7:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="5341780534" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10984" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="63" name="3170881683" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="54656" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="complex_batch_normalization_2/strided_slice_12/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="complex_batch_normalization_2/strided_slice_12:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32" names="complex_batch_normalization_2/strided_slice_13:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="complex_batch_normalization_2/concat_8" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/concat_8:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="complex_batch_normalization_2/mul_24" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/mul_24:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="complex_batch_normalization_2/add_13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/add_13:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="complex_batch_normalization_2/mul_25" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/mul_25:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="complex_batch_normalization_2/mul_26/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="54672" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_2/concat_10:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="5342381665" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10984" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="71" name="3171382103" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="54656" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="complex_batch_normalization_2/strided_slice_14/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="complex_batch_normalization_2/strided_slice_14:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32" names="complex_batch_normalization_2/strided_slice_15:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="complex_batch_normalization_2/concat_11" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/concat_11:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="complex_batch_normalization_2/mul_26" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/mul_26:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="complex_batch_normalization_2/add_14" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/add_14:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="complex_batch_normalization_2/add_15/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1, 1" offset="54752" size="80" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_2/Reshape_15:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="complex_batch_normalization_2/add_15" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_2/add_15:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="activation_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="activation_2/Relu:0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="complex_conv3d_3/concat_2" type="Const" version="opset1">
			<data element_type="f32" shape="16, 20, 9, 3, 1" offset="54832" size="34560" />
			<output>
				<port id="0" precision="FP32" names="complex_conv3d_3/concat_2:0">
					<dim>16</dim>
					<dim>20</dim>
					<dim>9</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="complex_conv3d_3/convolution" type="Convolution" version="opset1">
			<data strides="1, 1, 1" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>20</dim>
					<dim>9</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_conv3d_3/convolution:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_406634066581809" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="89392" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="complex_conv3d_3/add_1/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/sub_2:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="complex_batch_normalization_3/mul_23" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/mul_23:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="complex_batch_normalization_3/mul_24/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="89456" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_3/concat_7:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="5342982460" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10984" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="86" name="3171880942" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="89520" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="complex_batch_normalization_3/strided_slice_12/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="complex_batch_normalization_3/strided_slice_12:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32" names="complex_batch_normalization_3/strided_slice_13:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="complex_batch_normalization_3/concat_8" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/concat_8:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="complex_batch_normalization_3/mul_24" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/mul_24:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="complex_batch_normalization_3/add_13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/add_13:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="complex_batch_normalization_3/mul_25" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/mul_25:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="complex_batch_normalization_3/mul_26/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="89536" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_3/concat_10:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="5343580735" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="10984" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="94" name="3172381155" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="89520" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="complex_batch_normalization_3/strided_slice_14/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="complex_batch_normalization_3/strided_slice_14:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="4" precision="FP32" names="complex_batch_normalization_3/strided_slice_15:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="complex_batch_normalization_3/concat_11" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/concat_11:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="complex_batch_normalization_3/mul_26" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/mul_26:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="complex_batch_normalization_3/add_14" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/add_14:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="complex_batch_normalization_3/add_15/TransposeNHWCtoNCHW" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1, 1" offset="89600" size="64" />
			<output>
				<port id="0" precision="FP32" names="complex_batch_normalization_3/Reshape_15:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="complex_batch_normalization_3/add_15" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="complex_batch_normalization_3/add_15:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="activation_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="activation_3/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>33</dim>
					<dim>9</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="complex_conv3d_4/concat_2" type="Const" version="opset1">
